from db.connection import get_db_connection


def insert_cosmetic_category(data):
    conn = get_db_connection()
    if not conn:
        return -1

    try:
        with conn.cursor() as cur:
            # mogrify는 cur가 있어야 쓸 수 있다다
            values_str = ",\n".join([
                cur.mogrify("(%s, %s, %s)", (major, middle, no)
                            ).decode("utf-8")
                for major, middle, no in data
            ])

            query = f"""
            INSERT INTO cosmetic_categories (major_category, middle_category, category_no)
            VALUES {values_str};
            """

            cur.execute(query)
        return 1

    except Exception as e:
        print("카테고리 삽입 오류:", e)
        return -1
    finally:
        conn.close()


def get_category_id_by_category_no(cosmetic_no):
    query = """
    SELECT category_id FROM cosmetic_categories
    WHERE category_no = %s
    """

    conn = get_db_connection()
    if not conn:
        return False

    try:
        with conn.cursor() as cur:
            cur.execute(query, (cosmetic_no, ))
            row = cur.fetchone()
            if row:
                return row[0]
            else:
                return
    except Exception as e:
        print("카테고리 조회 오류:", e)
        return False
    finally:
        conn.close()


# 테이블 데이터 생성
data = [
    ("스킨케어", "미스트/오일", "100000100010010"),
    ("스킨케어", "스킨/토너", "100000100010013"),
    ("스킨케어", "에센스/세럼/앰플", "100000100010014"),
    ("스킨케어", "크림", "100000100010015"),
    ("스킨케어", "로션", "100000100010016"),
    ("스킨케어", "스킨케어세트", "100000100010017"),
    ("메이크업", "베이스메이크업", "100000100020001"),
    ("메이크업", "립메이크업", "100000100020006"),
    ("메이크업", "아이메이크업", "100000100020007"),
    ("바디케어", "샤워/입욕", "100000100030005"),
    ("바디케어", "립케어", "100000100030008"),
    ("바디케어", "데오드란트", "100000100030012"),
    ("바디케어", "로션/오일", "100000100030014"),
    ("바디케어", "바디미스트", "100000100030015"),
    ("바디케어", "핸드케어", "100000100030016"),
    ("바디케어", "선물세트", "100000100030017"),
    ("바디케어", "제모/왁싱", "100000100030019"),
    ("바디케어", "베이비", "100000100030020"),
    ("헤어케어", "트리트먼트/팩", "100000100040007"),
    ("헤어케어", "샴푸/린스", "100000100040008"),
    ("헤어케어", "염색약/펌", "100000100040010"),
    ("헤어케어", "스타일링", "100000100040011"),
    ("헤어케어", "헤어에센스", "100000100040013"),
    ("향수/디퓨저", "여성향수", "100000100050003"),
    ("향수/디퓨저", "남성향수", "100000100050004"),
    ("향수/디퓨저", "미니/고체향수", "100000100050010"),
    ("향수/디퓨저", "유니섹스향수", "100000100050011"),
    ("뷰티소품", "메이크업소품", "100000100060001"),
    ("뷰티소품", "뷰티잡화", "100000100060005"),
    ("뷰티소품", "스킨케어소품", "100000100060006"),
    ("맨즈케어", "스킨케어", "100000100070007"),
    ("맨즈케어", "메이크업", "100000100070008"),
    ("맨즈케어", "헤어케어", "100000100070009"),
    ("맨즈케어", "쉐이빙", "100000100070010"),
    ("맨즈케어", "바디케어", "100000100070011"),
    ("맨즈케어", "프래그런스/라이프", "100000100070017"),
    ("더모 코스메틱", "바디케어", "100000100080004"),
    ("더모 코스메틱", "선케어", "100000100080005"),
    ("더모 코스메틱", "스킨케어", "100000100080013"),
    ("마스크팩", "시트팩", "100000100090001"),
    ("마스크팩", "페이셜팩", "100000100090002"),
    ("마스크팩", "패드", "100000100090004"),
    ("마스크팩", "코팩", "100000100090005"),
    ("마스크팩", "패치", "100000100090006"),
    ("클렌징", "클렌징폼/젤", "100000100100001"),
    ("클렌징", "오일/밤", "100000100100004"),
    ("클렌징", "워터/밀크", "100000100100005"),
    ("클렌징", "립&아이리무버", "100000100100006"),
    ("클렌징", "필링&스크럽", "100000100100007"),
    ("클렌징", "티슈/패드", "100000100100008"),
    ("선케어", "태닝/애프터선", "100000100110002"),
    ("선케어", "선스틱", "100000100110003"),
    ("선케어", "선쿠션", "100000100110004"),
    ("선케어", "선스프레이/선패치", "100000100110005"),
    ("선케어", "선크림", "100000100110006"),
    ("네일", "네일케어", "100000100120004"),
    ("네일", "일반네일", "100000100120007"),
    ("네일", "네일팁/스티커", "100000100120008"),
    ("네일", "젤네일", "100000100120010"),
    ("여성/위생용품", "Y존케어", "100000200040006"),
    ("여성/위생용품", "마사지젤/오일", "100000200040009"),
    ("헬스/건강용품", "패치/겔", "100000200050001"),
    ("헬스/건강용품", "눈 관리 용품", "100000200050002"),
    ("헬스/건강용품", "생활/의료", "100000200050003"),
    ("헬스/건강용품", "마사지/헬스용품", "100000200050004"),
    ("헬스/건강용품", "풋케어", "100000200050005"),
    ("리빙/가전", "방향/탈취", "100000300050011"),
    ("리빙/가전", "베이비", "100000300050015"),
    ("리빙/가전", "제지류", "100000300050016"),
]

# insert_cosmetic_category(data)
